articles/_posts/2013-04-01-blogging-with-org-mode.html
(setf
title     "Blogging with Emacs' org-mode"
meta-keys "Blogging, emacs, common lisp"
meta-desc "Setting up emacs for blogging"
author    "Matthew Carter")
---


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Blogging with Emacs' org-mode/org-publish</a>
<ul>
<li><a href="#sec-1-1">Getting started</a></li>
<li><a href="#sec-1-2">Generating the final html</a></li>
</ul>
</li>
<li><a href="#sec-2">Update</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">Blogging with Emacs' org-mode/org-publish</h2>
<div class="outline-text-2" id="text-1">

<p>Emacs is an amazing tool, and blogging in emacs' org-mode can be a very
enjoyable experience.
</p>
<p>
Using the software set up available at:
<a href="https://github.com/ahungry/ahungry-blog">https://github.com/ahungry/ahungry-blog</a>
</p>
<p>
You will be able to set up a blog entry through org-mode, publish it
via org-publish, and finally expand the tags set at the start of the org-mode
file via the generate-html.lisp script provided in the repository.
</p>

</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1">Getting started</h3>
<div class="outline-text-3" id="text-1-1">

<p>To get started, you will need to clone the repository with the following:
</p>


<pre class="src src-shell">git clone https://github.com/ahungry/ahungry-blog.git
</pre>


<p>
After you have cloned the repository, you will want to set up your first test
entry, do that via the following commands in your shell:
</p>


<pre class="src src-shell">cd ./ahungry-blog/org
cp ./sample.org ./_posts
</pre>


<p>
At this point, you will have the base template to start setting up your first
blog entry.
</p>
<p>
However, there is one more thing that must be done, add the required ~/.emacs information
to set org-publish parameters.
</p>
<p>
If you are not using the directory, "/srv/http/ahungry-blog" for this, you will need
to manually edit the file.  If you are, simply type the following into your shell:
</p>


<pre class="src src-shell">cd /srv/http/ahungry-blog
cat ./dot-emacs &gt;&gt; ~/.emacs
</pre>


<p>
And in emacs, run:
</p>


<pre class="src src-shell">M-x load-file
~/.emacs
</pre>


<p>
to re-evaluate the new configuration information.
</p></div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2">Generating the final html</h3>
<div class="outline-text-3" id="text-1-2">

<p>After you've had a chance to work on your sample file, you will want to save
your .org file.
</p>
<p>
It is now time to publish the file, in emacs simply run:
</p>


<pre class="src src-shell">M-x org-publish
weblog
</pre>


<p>
This will generate the raw html file with the common lisp s-exp's in it still.
</p>
<p>
The final step to produce usable static html files from this is to run:
</p>



<pre class="src src-shell">./generate-html.lisp ./articles/_posts/*
</pre>


<p>
You will now see your articles directory contains a fully expanded version of
all the relevant posts.
</p>
</div>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">Update <span class="timestamp-wrapper"> <span class="timestamp">2013-04-20 Sat</span></span></h2>
<div class="outline-text-2" id="text-2">

<p>Using the content in the dot-files included with the package will allow you to run the following commands:
</p>


<pre class="src src-bash">M-x ahungry-new-blog
</pre>

<p>
To start a new blog entry (follow the prompts).
</p>
<p>
To easily publish your new entries and push to a remote git repository which will host your blog you can run:
</p>


<pre class="src src-bash">M-x ahungry-publish
</pre>

</div>
</div>
